test/fixtures/xml/fedex/raterequest_response_with_ground_home_delivery.xml

<?xml version="1.0"?>
<RateReply xmlns="http://fedex.com/ws/rate/v13" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <HighestSeverity>NOTE</HighestSeverity>
  <Notifications>
    <Severity>NOTE</Severity>
    <Source>crs</Source>
    <Code>819</Code>
    <Message>The origin state/province code has been changed.  </Message>
    <LocalizedMessage>The origin state/province code has been changed.  </LocalizedMessage>
  </Notifications>
  <Notifications>
    <Severity>NOTE</Severity>
    <Source>crs</Source>
    <Code>820</Code>
    <Message>The destination state/province code has been changed.  </Message>
    <LocalizedMessage>The destination state/province code has been changed.  </LocalizedMessage>
  </Notifications>
  <TransactionDetail>
    <CustomerTransactionId>ActiveShipping</CustomerTransactionId>
  </TransactionDetail>
  <Version>
    <ServiceId>crs</ServiceId>
    <Major>13</Major>
    <Intermediate>0</Intermediate>
    <Minor>0</Minor>
  </Version>
  <RateReplyDetails>
    <ServiceType>GROUND_HOME_DELIVERY</ServiceType>
    <PackagingType>YOUR_PACKAGING</PackagingType>
    <DeliveryStation>QNYA </DeliveryStation>
    <CommitDetails>
      <ServiceType>GROUND_HOME_DELIVERY</ServiceType>
      <TransitTime>THREE_DAYS</TransitTime>
      <BrokerToDestinationDays>0</BrokerToDestinationDays>
    </CommitDetails>
    <DestinationAirportId>EWR</DestinationAirportId>
    <IneligibleForMoneyBackGuarantee>false</IneligibleForMoneyBackGuarantee>
    <OriginServiceArea>A2</OriginServiceArea>
    <DestinationServiceArea>A1</DestinationServiceArea>
    <TransitTime>THREE_DAYS</TransitTime>
    <SignatureOption>SERVICE_DEFAULT</SignatureOption>
    <ActualRateType>PAYOR_ACCOUNT_PACKAGE</ActualRateType>
    <RatedShipmentDetails>
      <ShipmentRateDetail>
        <RateType>PAYOR_ACCOUNT_PACKAGE</RateType>
        <RateZone>6</RateZone>
        <RatedWeightMethod>ACTUAL</RatedWeightMethod>
        <MinimumChargeType>CUSTOMER</MinimumChargeType>
        <DimDivisor>0</DimDivisor>
        <FuelSurchargePercent>4.0</FuelSurchargePercent>
        <TotalBillingWeight>
          <Units>LB</Units>
          <Value>1.0</Value>
        </TotalBillingWeight>
        <TotalBaseCharge>
          <Currency>USD</Currency>
          <Amount>7.94</Amount>
        </TotalBaseCharge>
        <TotalFreightDiscounts>
          <Currency>USD</Currency>
          <Amount>1.33</Amount>
        </TotalFreightDiscounts>
        <TotalNetFreight>
          <Currency>USD</Currency>
          <Amount>6.61</Amount>
        </TotalNetFreight>
        <TotalSurcharges>
          <Currency>USD</Currency>
          <Amount>3.48</Amount>
        </TotalSurcharges>
        <TotalNetFedExCharge>
          <Currency>USD</Currency>
          <Amount>10.09</Amount>
        </TotalNetFedExCharge>
        <TotalTaxes>
          <Currency>USD</Currency>
          <Amount>0.0</Amount>
        </TotalTaxes>
        <TotalNetCharge>
          <Currency>USD</Currency>
          <Amount>10.09</Amount>
        </TotalNetCharge>
        <TotalRebates>
          <Currency>USD</Currency>
          <Amount>0.0</Amount>
        </TotalRebates>
        <FreightDiscounts>
          <RateDiscountType>VOLUME</RateDiscountType>
          <Description>Matrix</Description>
          <Amount>
            <Currency>USD</Currency>
            <Amount>0.64</Amount>
          </Amount>
          <Percent>0.0</Percent>
        </FreightDiscounts>
        <FreightDiscounts>
          <RateDiscountType>EARNED</RateDiscountType>
          <Description>Earned</Description>
          <Amount>
            <Currency>USD</Currency>
            <Amount>0.69</Amount>
          </Amount>
          <Percent>8.72</Percent>
        </FreightDiscounts>
        <Surcharges>
          <SurchargeType>RESIDENTIAL_DELIVERY</SurchargeType>
          <Level>PACKAGE</Level>
          <Description>FedEx Home Delivery Urban/Rural Charge</Description>
          <Amount>
            <Currency>USD</Currency>
            <Amount>3.1</Amount>
          </Amount>
        </Surcharges>
        <Surcharges>
          <SurchargeType>FUEL</SurchargeType>
          <Level>PACKAGE</Level>
          <Description>FedEx Ground Fuel</Description>
          <Amount>
            <Currency>USD</Currency>
            <Amount>0.38</Amount>
          </Amount>
        </Surcharges>
      </ShipmentRateDetail>
      <RatedPackages>
        <GroupNumber>0</GroupNumber>
        <PackageRateDetail>
          <RateType>PAYOR_ACCOUNT_PACKAGE</RateType>
          <RatedWeightMethod>ACTUAL</RatedWeightMethod>
          <MinimumChargeType>CUSTOMER</MinimumChargeType>
          <BillingWeight>
            <Units>LB</Units>
            <Value>1.0</Value>
          </BillingWeight>
          <BaseCharge>
            <Currency>USD</Currency>
            <Amount>7.94</Amount>
          </BaseCharge>
          <TotalFreightDiscounts>
            <Currency>USD</Currency>
            <Amount>1.33</Amount>
          </TotalFreightDiscounts>
          <NetFreight>
            <Currency>USD</Currency>
            <Amount>6.61</Amount>
          </NetFreight>
          <TotalSurcharges>
            <Currency>USD</Currency>
            <Amount>3.48</Amount>
          </TotalSurcharges>
          <NetFedExCharge>
            <Currency>USD</Currency>
            <Amount>10.09</Amount>
          </NetFedExCharge>
          <TotalTaxes>
            <Currency>USD</Currency>
            <Amount>0.0</Amount>
          </TotalTaxes>
          <NetCharge>
            <Currency>USD</Currency>
            <Amount>10.09</Amount>
          </NetCharge>
          <TotalRebates>
            <Currency>USD</Currency>
            <Amount>0.0</Amount>
          </TotalRebates>
          <FreightDiscounts>
            <RateDiscountType>VOLUME</RateDiscountType>
            <Description>Matrix</Description>
            <Amount>
              <Currency>USD</Currency>
              <Amount>0.64</Amount>
            </Amount>
            <Percent>0.0</Percent>
          </FreightDiscounts>
          <FreightDiscounts>
            <RateDiscountType>EARNED</RateDiscountType>
            <Description>Earned</Description>
            <Amount>
              <Currency>USD</Currency>
              <Amount>0.69</Amount>
            </Amount>
            <Percent>8.72</Percent>
          </FreightDiscounts>
          <Surcharges>
            <SurchargeType>RESIDENTIAL_DELIVERY</SurchargeType>
            <Level>PACKAGE</Level>
            <Description>FedEx Home Delivery Urban/Rural Charge</Description>
            <Amount>
              <Currency>USD</Currency>
              <Amount>3.1</Amount>
            </Amount>
          </Surcharges>
          <Surcharges>
            <SurchargeType>FUEL</SurchargeType>
            <Level>PACKAGE</Level>
            <Description>FedEx Ground Fuel</Description>
            <Amount>
              <Currency>USD</Currency>
              <Amount>0.38</Amount>
            </Amount>
          </Surcharges>
        </PackageRateDetail>
      </RatedPackages>
    </RatedShipmentDetails>
  </RateReplyDetails>
</RateReply>
